#!/usr/bin/python3

pai = [
    '1m', '1m', '1m', '1m', '2m', '2m', '2m', '2m', '3m', '3m', '3m', '3m',
    '4m', '4m', '4m', '4m', '0m', '5m', '5m', '5m', '6m', '6m', '6m', '6m',
    '7m', '7m', '7m', '7m', '8m', '8m', '8m', '8m', '9m', '9m', '9m', '9m',
    '1p', '1p', '1p', '1p', '2p', '2p', '2p', '2p', '3p', '3p', '3p', '3p',
    '4p', '4p', '4p', '4p', '0p', '5p', '5p', '5p', '6p', '6p', '6p', '6p',
    '7p', '7p', '7p', '7p', '8p', '8p', '8p', '8p', '9p', '9p', '9p', '9p',
    '1s', '1s', '1s', '1s', '2s', '2s', '2s', '2s', '3s', '3s', '3s', '3s',
    '4s', '4s', '4s', '4s', '0s', '5s', '5s', '5s', '6s', '6s', '6s', '6s',
    '7s', '7s', '7s', '7s', '8s', '8s', '8s', '8s', '9s', '9s', '9s', '9s',
    '東', '東', '東', '東', '南', '南', '南', '南', '西', '西', '西', '西', '北', '北', '北', '北',
    '白', '白', '白', '白', '發', '發', '發', '發', '中', '中', '中', '中',
]

pai2 = [
    '1m', '1m', '1m', '1m', '2m', '2m', '2m', '2m', '3m', '3m', '3m', '3m',
    '4m', '4m', '4m', '4m', '5m', '5m', '5m', '5m', '6m', '6m', '6m', '6m',
    '7m', '7m', '7m', '7m', '8m', '8m', '8m', '8m', '9m', '9m', '9m', '9m',
    '1p', '1p', '1p', '1p', '2p', '2p', '2p', '2p', '3p', '3p', '3p', '3p',
    '4p', '4p', '4p', '4p', '5p', '5p', '5p', '5p', '6p', '6p', '6p', '6p',
    '7p', '7p', '7p', '7p', '8p', '8p', '8p', '8p', '9p', '9p', '9p', '9p',
    '1s', '1s', '1s', '1s', '2s', '2s', '2s', '2s', '3s', '3s', '3s', '3s',
    '4s', '4s', '4s', '4s', '5s', '5s', '5s', '5s', '6s', '6s', '6s', '6s',
    '7s', '7s', '7s', '7s', '8s', '8s', '8s', '8s', '9s', '9s', '9s', '9s',
    '1z', '1z', '1z', '1z', '2z', '2z', '2z', '2z', '3z', '3z', '3z', '3z', '4z', '4z', '4z', '4z',
    '5z', '5z', '5z', '5z', '6z', '6z', '6z', '6z', '7z', '7z', '7z', '7z',
]

yaku = [
    # 一飜
    '門前清自摸和','立直','一発','槍槓','嶺上開花',
    '海底摸月','河底撈魚','平和','断幺九','一盃口',
    '自風 東','自風 南','自風 西','自風 北',
    '場風 東','場風 南','場風 西','場風 北',
    '役牌 白','役牌 發','役牌 中',
    # 二飜
    '両立直','七対子','混全帯幺九','一気通貫','三色同順',
    '三色同刻','三槓子','対々和','三暗刻','小三元','混老頭',
    # 三飜
    '二盃口','純全帯幺九','混一色',
    # 六飜
    '清一色',
    # 満貫
    '人和',
    # 役満
    '天和','地和','大三元','四暗刻','四暗刻単騎','字一色',
    '緑一色','清老頭','九蓮宝燈','純正九蓮宝燈','国士無双',
    '国士無双13面','大四喜','小四喜','四槓子',
    # 懸賞役
    'ドラ','裏ドラ','赤ドラ'
]

ten_class = [
    '', '満貫', '跳満', '倍満', '三倍満', '役満'
]

ryuukyoku_type = {
    'yao9': '九種九牌',
    'reach4': '四家立直',
    'ron3': '三家和了',
    'kan4': '四槓散了',
    'kaze4': '四風連打',
    'nm': '流し満貫',
}

shanten = [
    '聴牌',
    '一向聴',
    '二向聴',
    '三向聴',
    '四向聴',
    '五向聴',
    '六向聴',
]